import random
from english_words import get_english_words_set

# 现代汉语常用字表中的 3500 个常用汉字
common_chinese_chars = "的一是在不了有和人这中大为上个国我以要他时来用们生到作地于出就分对成会可主发年动同工也能下过子说产种面而方后多定行学法所民得经十三之进着等部度家电力里如水化高自二理起小物现实加量都两体制机当使点从业本去把性好应开它合还因由其些然前外天政四日那社义事平形相全表间样与关各重新线内数正心反你明看原又么利比或但质气第向道命此变条只没结解问意建月公无系军很情者最立代想已通并提直题党程展五果料象员革位入常文总次品式活设及管特件长求老头基资边流路级少图山统接知较将组见计别她手角期根论运农指几九区强放决西被干做必战先回则任取据处队南给色光门即保治北造百规热领七海口东导器压志世金增争济阶油思术极交受联什认六共权收证改清己美再采转更单风切打白教速花带安场身车例真务具万每目至达走积示议声报斗完类八离华名确才科张信马节话米整空元况今集温传土许步群广石记需段研界拉林律叫且究观越织装影算低持音众书布复容儿须际商非验连断深难近矿千周委素技备半办青省列习响约支般史感劳便团往酸历市克何除消构府称太准精值号率族维划选标写存候毛亲快效斯院查江型眼王按格养易置派层片始却专状育厂京识适属圆包火住调满县局照参红细引听该铁价严龙飞"


# 常见中文姓氏列表
common_surnames = [
    "赵", "钱", "孙", "李", "周", "吴", "郑", "王", "冯", "陈",
    "褚", "卫", "蒋", "沈", "韩", "杨", "朱", "秦", "尤", "许",
    "何", "吕", "施", "张", "孔", "曹", "严", "华", "金", "魏",
    "陶", "姜", "戚", "谢", "邹", "喻", "柏", "水", "窦", "章",
    "云", "苏", "潘", "葛", "奚", "范", "彭", "郎", "鲁", "韦",
    "昌", "马", "苗", "凤", "花", "方", "俞", "任", "袁", "柳",
    "酆", "鲍", "史", "唐", "费", "廉", "岑", "薛", "雷", "贺",
    "倪", "汤", "滕", "殷", "罗", "毕", "郝", "邬", "安", "常",
    "乐", "于", "时", "傅", "皮", "卞", "齐", "康", "伍", "余",
    "元", "卜", "顾", "孟", "平", "黄", "和", "穆", "萧", "尹",
    "姚", "邵", "湛", "汪", "祁", "毛", "禹", "狄", "米", "贝",
    "明", "臧", "计", "伏", "成", "戴", "谈", "宋", "茅", "庞",
    "熊", "纪", "舒", "屈", "项", "祝", "董", "梁", "杜", "阮",
    "蓝", "闵", "席", "季", "麻", "强", "贾", "路", "娄", "危",
    "江", "童", "颜", "郭", "梅", "盛", "林", "刁", "钟", "徐",
    "邱", "骆", "高", "夏", "蔡", "田", "樊", "胡", "凌", "霍",
    "虞", "万", "支", "柯", "昝", "管", "卢", "莫", "经", "房",
    "裘", "缪", "干", "解", "应", "宗", "丁", "宣", "贲", "邓",
    "郁", "单", "杭", "洪", "包", "诸", "左", "石", "崔", "吉",
    "钮", "龚", "程", "嵇", "邢", "滑", "裴", "陆", "荣", "翁"
]
# 常用中文名字列表
common_names = [
    "伟", "芳", "娜", "敏", "静", "强", "磊", "军", "洋", "勇",
    "艳", "杰", "娟", "涛", "明", "超", "秀", "霞", "平", "刚",
    "丽", "辉", "俊", "浩", "婷", "慧", "颖", "佳", "健", "琳",
    "子", "萱", "梓", "涵", "雨", "晨", "瑞", "琪", "嘉", "欣",
    "宇", "泽", "梓", "轩", "俊", "豪", "博", "睿", "思", "雅",
    "诗", "涵", "语", "嫣", "若", "熙", "梓", "萌", "紫", "菱",
    "梦", "璐", "瑶", "怡", "嘉", "琪", "晨", "阳", "晨", "峰",
    "铭", "洋", "凯", "翔", "旭", "昊", "浩", "南", "泽", "霖",
    "梓", "彤", "佳", "怡", "悦", "慧", "敏", "惠", "珠", "翠",
    "雅", "芝", "玉", "萍", "红", "娥", "玲", "芬", "芳", "燕",
    "彩", "春", "菊", "兰", "凤", "洁", "梅", "琳", "素", "云"
]
# 介词
common_actions1 = [
    "为什么","为何","想","不想","莫名其妙","很快","就要","马上","立刻","稍后","后天","昨天","前天",
]
# 动作
common_actions = [
    "去","向往","讨厌","喜欢","无感",
]
# 地名
common_citys = [
    "上学","上海","shopping","买菜","做饭","打球","唱歌","吃饭","开车","旅游","游泳","上班","种地"
]

def generate_random_common_words():
    words_set = get_english_words_set(['web2'])
    # 随机生成字符串的长度，范围在 3 到 6 之间
    length = random.randint(3, 6)
    result = ""
    for _ in range(length):
        # 从常用汉字列表中随机选择一个汉字
        result += random.choice(list(words_set)) + " "
    return result

def generate_random_common_chinese():
    # 随机生成字符串的长度，范围在 3 到 6 之间
    length = random.randint(4, 8)
    result = ""
    for _ in range(length):
        # 从常用汉字列表中随机选择一个汉字
        result += random.choice(common_chinese_chars)
    return result

def generate_random_common_chinese1():
    
    result = ""

    if random.randint(1, 100) > 50:
        result += random.choice(common_actions1)

    result += random.choice(common_surnames)
    result += random.choice(common_names)
    if random.randint(1, 100) > 50:
        result += random.choice(common_names)

    result += random.choice(common_actions)
    result += random.choice(common_citys)

    # length = random.randint(min, max)
    # result = ""
    # for _ in range(length):
    #     # 从常用汉字列表中随机选择一个汉字
    #     result += random.choice(common_chinese_chars)
    return result

if __name__ == "__main__":
    # 生成并打印随机常用中文字符串
    random_chinese = generate_random_common_chinese1()
    print(random_chinese)